app/controllers/post_controller.rb

SELECT `files`.* FROM `files` WHERE `files`.`posts_id` IN (3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` ASC LIMIT 1
---
  def index
  	render json: Posts.includes(:files).all

INSERT INTO `posts` (`content`, `created_at`, `permalink`, `title`, `updated_at`, `users_id`) VALUES (?, ?, ?, ?, ?, ?)  [["content", "sf"], ["created_at", Mon, 07 Jul 2014 07:10:23 UTC +00:00], ["permalink", "here"], ["title", "testing"], ["updated_at", Mon, 07 Jul 2014 07:10:23 UTC +00:00], ["users_id", 1]]
INSERT INTO `files` (`created_at`, `filename`, `filepath`, `mimetype`, `original_filename`, `posts_id`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	post = Posts.create({
  		title: params[:title],
  		permalink: params[:permalink],
  		content: params[:content],
  		users_id: 1
  	})

    if params[:form].present?
      image = params[:form][:file]
      _fileUpload(image)

      file = Files.create({
        original_filename: @name,
        filepath: 'upload/' + @hash_value,
        filename: @hash_value,
        mimetype: image.content_type,
        posts_id: post[:id]
      })

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `posts` SET `title` = ?, `permalink` = ?, `content` = ?, `updated_at` = ? WHERE `posts`.`id` = 3  [["title", ""], ["permalink", ""], ["content", ""], ["updated_at", Fri, 11 Jul 2014 04:39:04 UTC +00:00]]
SELECT `files`.* FROM `files` WHERE `files`.`posts_id` = 3 ORDER BY `files`.`id` ASC LIMIT 1
SELECT `files`.* FROM `files` WHERE `files`.`post_id` = 3
DELETE FROM `files` WHERE `files`.`id` = ?  [["id", 1]]
INSERT INTO `files` (`created_at`, `filename`, `filepath`, `mimetype`, `original_filename`, `posts_id`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def update
    post = Posts.find params[:id]

    if post.present?
      post.update({
        title: params[:title],
        permalink: params[:permalink],
        content: params[:content]
      })

      if params[:form].present?
        image = params[:form][:file]
        file_exist = Files.where(posts_id: post[:id]).first
        if file_exist.present?
          path = Rails.root + file_exist.filepath

          file_exist.destroy

          # physical delete file
          File.delete(path) if File.exist?(path)
        end

        _fileUpload(image)

        file = Files.create({
          original_filename: @name,
          filepath: 'upload/' + @hash_value,
          filename: @hash_value,
          mimetype: image.content_type,
          posts_id: post[:id]
        })

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", "1"]]
DELETE FROM `posts` WHERE `posts`.`id` = ?  [["id", 1]]
---
  def destroy
    post = Posts.find params[:id]
    post.destroy()

SELECT `files`.* FROM `files` WHERE `files`.`id` = ? LIMIT 1  [["id", "2"]]
---
  def image
    if Files.exists? id: params[:id]
      # get file
      @image = Files.find params[:id]